## [mani-demo](https://vardhamani.app.spacelift.io/stack/mani-demo/run/01HJ91RYT6JN56F0SAWH3CSGST) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HJ838FNGHSTCXYBN5TEJHMWA] Planning changes with 0 custom hooks...
aws_instance.example: Refreshing state... [id=i-021ba9525bf10493c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.example1 will be created
  + resource "aws_instance" "example1" {
      + ami                                  = "ami-079db87dc4c10ac91"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "Tagging-instance"
        }
      + tags_all                             = {
          + "Name" = "Tagging-instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01HJ838FNGHSTCXYBN5TEJHMWA] Changes are GO
[01HJ838FNGHSTCXYBN5TEJHMWA] Uploading the list of managed resources...
[01HJ838FNGHSTCXYBN5TEJHMWA] Please be aware that the run changes calculation includes output changes.
[01HJ838FNGHSTCXYBN5TEJHMWA] Resource list upload is GO
[01HJ838FNGHSTCXYBN5TEJHMWA] Generating JSON representation of the plan...
[01HJ838FNGHSTCXYBN5TEJHMWA] JSON representation is GO
[01HJ838FNGHSTCXYBN5TEJHMWA] Loading custom plan policy inputs...
[01HJ838FNGHSTCXYBN5TEJHMWA] 0 custom plan policy inputs found
[01HJ838FNGHSTCXYBN5TEJHMWA] No plan policies to evaluate
```

</details>